/*************************************************************************
	> File Name: pointer_array.c
	> Author: 
	> Mail: 
	> Created Time: 2019年09月16日 星期一 09时10分06秒
 ************************************************************************/

#include<stdio.h>

int main()
{
    //int *p1[10]   指针数组，首先它是一个数组，数组元素都是指针
    //int (*p2)[10]  数组指针，首先他是一个指针，它指向一个数组
    char a[5] = {'A', 'B', 'C', 'D'};
    char (*p3)[5] = &a;
    //&a是数组的首地址，a是数组的首元素的首地址
    //char (*pa)[5] = a;   两边的数据类型不一致，warning
    
    //char (*p5)[3] = &a;
    //char (*p6)[3] = a;

    
}
