/*************************************************************************
	> File Name: q.c
	> Author:jieni 
	> Mail: 
	> Created Time: 2020年06月27日 星期六 14时34分56秒
 ************************************************************************/

#include <stdio.h>

int main()
{
    char c;
    scanf("%c", &c);
    if (c>='A' && c<= 'Z')
        printf("该大写字母对应的小写字母%c\n", c+32);
    else if (c>='a' && c<= 'z')
        printf("该小写字母对应的大写字母%c\n", c-32);
    else
        printf("输入不是字母\n");
    return 0;
}

