/*************************************************************************
	> File Name: test2.c
	> Author: 
	> Mail: 
	> Created Time: 2019年09月22日 星期日 12时43分05秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    int a[10] = {0,1,2,3,4,5,6,7,8,9};
    int *p = a;
    for (int i = 0; i < 10; i++) {
	    printf("%d %d %d %d\n", a[i], *(a+i), *(p +i), p[i]);
    }

    int *p1[10];     // 指针数组
int (*p2)[10];	 // 数组指针
printf("%d\n", sizeof(p1));
printf("%d\n", sizeof(p2));
}
